data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_220/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
93600
(
(-0.899450281477 0.000219075361732 -4.05485227244e-19)
(-0.898136458097 0.000219056116938 5.19648823842e-19)
(-0.896466379807 0.000219048419815 -5.38761186271e-19)
(-0.894586016194 0.000219045551885 6.79304718463e-20)
(-0.892643212935 0.000219045877049 2.72083732117e-19)
(-0.890785482165 0.000219049479624 2.42828623464e-20)
(-0.889047922466 0.000219051661634 -6.41488964584e-20)
(-0.887349641043 0.000219051661643 -7.83456678432e-21)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(-0.9 0.000219052123178 6.60037083758e-20)
(-0.9 0.000660218491424 -3.46944695195e-20)
(-0.9 0.00110755190875 -4.448855119e-20)
(-0.9 0.0015611385841 -9.2648817756e-20)
(-0.9 0.00202106593157 5.10385933771e-20)
(-0.9 0.00248742258719 -3.46944695195e-20)
(-0.9 0.00296029842602 6.72211207848e-20)
(-0.9 0.00343978457949 -4.38317928636e-20)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(0.67 0.000219052123178 -6.60037083758e-20)
(0.67 0.000660218491424 3.46944695195e-20)
(0.67 0.00110755190875 4.448855119e-20)
(0.67 0.00156113858411 9.2648817756e-20)
(0.67 0.00202106593157 -5.10385933771e-20)
(0.67 0.00248742258719 3.46944695195e-20)
(0.67 0.00296029842602 -6.72211207848e-20)
(0.67 0.00343978457949 4.38317928636e-20)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
520
(
(-0.899450456449 0 4.27222771967e-20)
(-0.898136849805 0 -3.45924252659e-20)
(-0.896466767345 0 -5.29519338412e-20)
(-0.894586270089 0 4.37488153983e-20)
(-0.892643296303 0 -1.99671551936e-20)
(-0.890785450498 0 -7.44367706176e-20)
(-0.889047853239 0 -5.89213124166e-20)
(-0.887349561082 0 -3.79638402739e-20)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
520
(
(-0.899170916529 0.35 -2.40522842923e-20)
(-0.897510992736 0.35 -2.83542404377e-21)
(-0.895847551517 0.35 3.94861124294e-20)
(-0.894180585418 0.35 -1.29867828397e-19)
(-0.89251008697 0.35 1.80678139409e-20)
(-0.890836048688 0.35 -6.6284898583e-20)
(-0.889158463071 0.35 -3.17083993866e-21)
(-0.887477322602 0.35 -2.42088123978e-20)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
