data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_220/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 316.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
        220
        (
            11484.87267
            4001.889846
            2293.621463
            1765.868412
            1602.213997
            1431.236278
            1260.659872
            1095.366372
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 316.0;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
