data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_220/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   1;

#include "../fieldDef"

fields          $residualFields;
